public/poems.2024-02-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>They're seldom things but brisk gusts' shrieks&#x2026;</title>
<meta name="author" content="Tomaz Geddes de Almeida" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='./css/tufte.css' />
<link rel='stylesheet' href='./css/header.css' />
<!-- Google tag (gtag.js) -->
</head>
<body>
<div id="preamble" class="status">
<div class="banner">
  <div id="l_app" style="float:left"></div>
  <a id="myname" href="/">Tomaz Geddes de Almeida</a>
  <div id="r_app" style="float:left"></div>
  
  <hr/>
  <nav>
    <p>
      <a href="/">Home</a>
      <a href="/about.html">About</a>
      <a href="/blog-index.html">Writing</a>
      <a href="https://github.com/tomazgda/">Github</a>
    </p>
  </nav>
</div>

<script>
  var l_app = Elm.Cube.init({
      node: document.getElementById('l_app')
  });
  var r_app = Elm.Cube.init({
      node: document.getElementById('r_app')
  });
</script>
</div>
<div id="content" class="content">
<h1 class="title">They're seldom things but brisk gusts' shrieks&#x2026;</h1>
<p class="subtitle">2024-02-07</p>


<p class="verse">
They're seldom things but brisk gusts' shrieks,<br />
across a barren planet's planes.<br />
Things that thought have been outcast.<br />
Bleak scenes of solemn are all that last.<br />
<br />
Bar a shadow, rippling on the sand<br />
edging forward, an outstretched hand.<br />
dragging onwards a dying man<br />
always moving, to escape this land.<br />
<br />
Leaks in past famed fision plants<br />
had brought destruction; paved the world<br />
with grit and grain, and nothing more.<br />
Yet now this man, this intruder was<br />
a living-thing come, a thing with cause.<br />
<br />
&#x2014;<br />
<br />
That disruption fret the wind.<br />
The crusade blast that killed all things.<br />
Now it spat and coughed and kicked,<br />
into the man the grain and grit.<br />
<br />
Rains of sand would on him fall;<br />
the wind wished death and nothing more.<br />
But exhausted it grew the more he crawled.<br />
The man who moved; the man who thought.<br />
<br />
&#x2014;<br />
<br />
Had he but not been long ago,<br />
one with dreams and life and hope;<br />
ambition scuffed with casual woes;<br />
worries still, but he could cope.<br />
<br />
Now hope was scarce,<br />
dwindling fast to nil.<br />
Hunger encroached,<br />
and thirst was hell.<br />
<br />
..but blisters:<br />
these were mortal wounds!<br />
he'd leave them here with the dunes!<br />
This sand that shifted, and danced and changed.<br />
His pain, like it, would disperse and fade<br />
<br />
Moments stretched on into days,<br />
He cursed all things; he cursed his name<br />
Forever past, it tempted death<br />
But after each chocked gasp, he took again a breath.<br />
<br />
&#x2014;<br />
<br />
Until it seemed the air did change.<br />
Gusts fell to drafts; a breeze of wind.<br />
Strange settlings of hazard down to bliss,<br />
brittle grains to earth: damp soil! He could kiss..<br />
<br />
Relief struck him like a nuclear blast.<br />
He dug deep his fingers, and cried, and laughed.<br />
He took to his feet,<br />
and with all loving strain, he proclaimed:<br />
"These are my lands; they will bear my name!<br />
This is my garden!<br />
And all will begin again!"<br />
<br />
</p>
</div>
<div id="postamble" class="status">
<hr />

Bring back the blogosphere!
</div>
</body>
</html>